Revit 2027 API
BuiltInFailures.CurveFailures.InvalidCurveForElement Property
 End positions are invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidCurveForElement { get; }
Public Shared ReadOnly Property InvalidCurveForElement As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidCurveForElement {
	FailureDefinitionId^ get ();
}
static member InvalidCurveForElement : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurveFailures Class
Autodesk.Revit.DB Namespace